docs/research/fathom-embed-ledger-plan-aligned/mutations/task2-m3-rollback-keeps-admission.patch
diff --git a/src/index_lifecycle/embedded.rs b/src/index_lifecycle/embedded.rs
index 430226d4..775c7e3f 100644
--- a/src/index_lifecycle/embedded.rs
+++ b/src/index_lifecycle/embedded.rs
@@ -370,24 +370,21 @@ impl Drop for OpenRollback {
         if self.committed {
             return;
         }
-        if let Some(binding) = &self.binding {
-            binding.shutdown();
-        }
+        let _ = &self.binding;
         let mut open = self
             .factory
             .open
             .lock()
             .expect("embedded registration mutex");
         if open
             .get(&self.key)
             .is_some_and(|source| source.identity == self.identity && source.opening)
         {
             open.remove(&self.key);
         }
         self.factory
             .shutdown
             .store(open.is_empty(), Ordering::Release);
         drop(open);
-        let _ = super::activation::process_project_registry().stop(&self.key);
     }
 }
 
