docs/research/fathom-embed-ledger-plan-aligned/mutations/task2-m4-shutdown-ignores-owner.patch
diff --git a/src/index_lifecycle/embedded.rs b/src/index_lifecycle/embedded.rs
index 430226d4..3a0f8101 100644
--- a/src/index_lifecycle/embedded.rs
+++ b/src/index_lifecycle/embedded.rs
@@ -985,10 +985,10 @@ impl EmbeddedSourceFactory {
     }
 
     pub(crate) fn shutdown_owner(&self, owner: EmbeddedIdentity) -> EmbeddedShutdownReport {
+        let _ = owner;
         let closing: Vec<(ProjectKey, Option<Arc<EmbeddedBinding>>)> = {
             let open = self.open.lock().expect("embedded registration mutex");
             open.iter()
-                .filter(|(_, source)| source.owner == Some(owner))
                 .map(|(key, source)| (key.clone(), source.binding.clone()))
                 .collect()
         };
@@ -1004,12 +1004,7 @@ impl EmbeddedSourceFactory {
         }
         let mut open = self.open.lock().expect("embedded registration mutex");
         for (key, _) in &closing {
-            if open
-                .get(key)
-                .is_some_and(|source| source.owner == Some(owner))
-            {
-                open.remove(key);
-            }
+            open.remove(key);
         }
         self.shutdown.store(open.is_empty(), Ordering::Release);
         EmbeddedShutdownReport {
