docs/research/fathom-embed-ledger-plan-aligned/mutations/task3-m0-hold-ignores-root.patch
diff --git a/src/live_index/store.rs b/src/live_index/store.rs
index 7699ba61..d70697ca 100644
--- a/src/live_index/store.rs
+++ b/src/live_index/store.rs
@@ -184,16 +184,14 @@ impl Drop for ReloadGateForTest {
 }
 
 #[cfg(feature = "__test-internals")]
-fn pause_after_parse_for_test(source_scope: &Path, cancel: Option<&AtomicBool>) {
+fn pause_after_parse_for_test(_source_scope: &Path, cancel: Option<&AtomicBool>) {
     let Some(state) = RELOAD_GATES
         .get()
-        .and_then(|gates| gates.lock().ok()?.get(source_scope).cloned())
+        .and_then(|gates| gates.lock().ok()?.values().next().cloned())
     else {
         return;
     };
-    if state.parsed.fetch_add(1, Ordering::AcqRel) + 1 != state.pause_after_parses {
-        return;
-    }
+    let _ = cancel;
     let mut blocked = state.blocked.lock().expect("reload gate state");
     *blocked = true;
     state.reached.notify_all();
