docs/research/fathom-embed-ledger-plan-aligned/mutations/task3-m0-hold-ignores-root.patch
diff --git a/src/live_index/store.rs b/src/live_index/store.rs
index 9d974c7a..218dc998 100644
--- a/src/live_index/store.rs
+++ b/src/live_index/store.rs
@@ -184,10 +184,10 @@ impl Drop for ReloadGateForTest {
 }
 
 #[cfg(feature = "__test-internals")]
-fn pause_after_parse_for_test(source_scope: &Path, cancel: Option<&AtomicBool>) {
+fn pause_after_parse_for_test(_source_scope: &Path, cancel: Option<&AtomicBool>) {
     let Some(state) = RELOAD_GATES
         .get()
-        .and_then(|gates| gates.lock().ok()?.get(source_scope).cloned())
+        .and_then(|gates| gates.lock().ok()?.values().next().cloned())
     else {
         return;
     };
