docs/research/fathom-embed-ledger-plan-aligned/mutations/task3-m7-no-derived-stage-checks.patch
diff --git a/src/live_index/store.rs b/src/live_index/store.rs
index 02def4ec..dda5e79d 100644
--- a/src/live_index/store.rs
+++ b/src/live_index/store.rs
@@ -253,7 +253,7 @@ fn pause_between_derived_stages(cancel: Option<&AtomicBool>) -> anyhow::Result<(
     if DERIVED_STAGE_HOLD.load(Ordering::Acquire) {
         DERIVED_STAGE_REACHED.store(true, Ordering::Release);
         loop {
-            check_reload_cancelled(cancel)?;
+            let _ = cancel;
             std::thread::sleep(Duration::from_millis(1));
         }
     }
