docs/research/fathom-embed-ledger-plan-aligned/mutations/task4-m3-census-counts-wrong.patch
diff --git a/src/index_lifecycle/embedded.rs b/src/index_lifecycle/embedded.rs
index 430226d4..01afacbb 100644
--- a/src/index_lifecycle/embedded.rs
+++ b/src/index_lifecycle/embedded.rs
@@ -1401,7 +1401,7 @@ impl EmbeddedSourceHandle {
             .map(|file| super::public_api::CensusFile {
                 path: file.relative_path.clone(),
                 language: file.language.name().to_string(),
-                symbol_count: u32::try_from(file.symbol_count).unwrap_or(u32::MAX),
+                symbol_count: 0,
             })
             .collect();
         let total_files = files.len() as u64;
