docs/research/fathom-embed-ledger-plan-aligned/mutations/task4-m5-census-skips-readiness-claim.patch
diff --git a/src/index_lifecycle/embedded.rs b/src/index_lifecycle/embedded.rs
index 430226d4..a5f5c240 100644
--- a/src/index_lifecycle/embedded.rs
+++ b/src/index_lifecycle/embedded.rs
@@ -660,7 +660,9 @@ impl EmbeddedBinding {
         normalized_arguments: &[u8],
     ) -> Result<CurrentEmbedClaim, super::public_api::EmbedSourceRefusal> {
         let state = self.state.lock().expect("embedded state mutex");
-        if state.phase != super::public_api::SourceRuntimePhase::Current {
+        if state.phase != super::public_api::SourceRuntimePhase::Current
+            && operation != crate::lifecycle_identity::OperationKind::IndexCensus
+        {
             let retry = match state.phase {
                 super::public_api::SourceRuntimePhase::Blocked => {
                     crate::lifecycle_identity::RetryAdvice::Operator
