docs/research/fathom-embed-ledger-plan-aligned/mutations/task6-m1-no-excluded-knowledge-note.patch
diff --git a/src/protocol/format.rs b/src/protocol/format.rs
index 723c503d..c88621cd 100644
--- a/src/protocol/format.rs
+++ b/src/protocol/format.rs
@@ -1169,7 +1169,7 @@ fn no_match_suggestions(ctx: SearchSuggestionContext) -> String {
 /// Returns `message` unchanged when `excluded` is 0 so a scope with no
 /// knowledge-only files never grows a `search_knowledge` note.
 pub(crate) fn append_excluded_knowledge_note(message: String, excluded: usize) -> String {
-    if excluded == 0 {
+    if true {
         return message;
     }
     let noun = if excluded == 1 { "file" } else { "files" };
