docs/research/fathom-embed-ledger-plan-aligned/mutations/task6-m3-note-always-printed.patch
diff --git a/src/protocol/format.rs b/src/protocol/format.rs
index 723c503d..3bf6060e 100644
--- a/src/protocol/format.rs
+++ b/src/protocol/format.rs
@@ -1169,9 +1169,6 @@ fn no_match_suggestions(ctx: SearchSuggestionContext) -> String {
 /// Returns `message` unchanged when `excluded` is 0 so a scope with no
 /// knowledge-only files never grows a `search_knowledge` note.
 pub(crate) fn append_excluded_knowledge_note(message: String, excluded: usize) -> String {
-    if excluded == 0 {
-        return message;
-    }
     let noun = if excluded == 1 { "file" } else { "files" };
     format!(
         "{message}\nThis search did not scan {excluded} in-scope knowledge-only {noun}; use search_knowledge."
